# LAB 137

1. Zaimportuj moduł pandas i numpy nadaj im standardowe aliasy
2. Do zmiennej suppliers zaimportuj zawartość pliku suppliers.csv. Pobierz tylko kolumny SupplierID, CompanyName, City
3. Do zmiennej products zaimportuj zawartość pliku products.csv". Pobierz tylko kolumny ProductID, ProductName, SupplierID**
4. W kolejnych zadaniach będziesz łączyć ze sobą suppliers i products, a do połączenia wykorzystasz kolumnę SupplierID. Kolumna ta może delikatnie zmienić nazwę lub stać się indeksem. W zależności od tego musisz w odpowiedni sposób zmieniać parametry i wybierać odpowiednie polecenia:
5. Do data frame suppliers dołącz dane z products (tak jak to opisano powyżej)
6. W suppliers zdefiniuj SupplierID jako indeks (pamiętaj o parametrze inplace). Następnie do data frame suppliers dołącz dane z products
7. W products zdefiniuj SupplierID jako indeks (pamiętaj o parametrze inplace). Następnie do data frame suppliers dołącz dane z products
8. W suppliers zresetuj indeks (pamiętaj o parametrze inplace). Następnie do data frame suppliers dołącz dane z products
9. W products zresetuj indeks (pamiętaj o parametrze inplace), a potem zmień nazwę kolumny SupplierID na supplier_id. Następnie do data frame suppliers dołącz dane z products

## Exercise 1

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math as math

## Exercise 2

In [10]:
suppliers = pd.read_csv("suppliers.csv", usecols=["SupplierID","CompanyName","City"])
suppliers.head()

   SupplierID                         CompanyName         City
0           1                      Exotic Liquids       London
1           2          New Orleans Cajun Delights  New Orleans
2           3           Grandma Kelly's Homestead    Ann Arbor
3           4                       Tokyo Traders        Tokyo
4           5  Cooperativa de Quesos 'Las Cabras'       Oviedo

## Exercise 3

In [3]:
products = pd.read_csv("products.csv", usecols=["ProductID","ProductName","SupplierID"])
products.head()

   ProductID                   ProductName  SupplierID
0          1                          Chai           1
1          2                         Chang           1
2          3                 Aniseed Syrup           1
3          4  Chef Anton's Cajun Seasoning           2
4          5        Chef Anton's Gumbo Mix           2

## Exercise 4

## Exercise 5

In [11]:
suppliers.merge(products, on='SupplierID').head(3)

   SupplierID     CompanyName    City  ProductID    ProductName
0           1  Exotic Liquids  London          1           Chai
1           1  Exotic Liquids  London          2          Chang
2           1  Exotic Liquids  London          3  Aniseed Syrup

## Exercise 6

In [12]:
suppliers.set_index("SupplierID", inplace=True)
suppliers.head()

                                   CompanyName         City
SupplierID
1                               Exotic Liquids       London
2                   New Orleans Cajun Delights  New Orleans
3                    Grandma Kelly's Homestead    Ann Arbor
4                                Tokyo Traders        Tokyo
5           Cooperativa de Quesos 'Las Cabras'       Oviedo

In [13]:
suppliers.merge(products, left_index=True, right_on="SupplierID").head(3)

      CompanyName    City  ProductID    ProductName  SupplierID
0  Exotic Liquids  London          1           Chai           1
1  Exotic Liquids  London          2          Chang           1
2  Exotic Liquids  London          3  Aniseed Syrup           1

## Exercise 7

In [14]:
products.set_index("SupplierID",inplace=True)
products.head()

            ProductID                   ProductName
SupplierID
1                   1                          Chai
1                   2                         Chang
1                   3                 Aniseed Syrup
2                   4  Chef Anton's Cajun Seasoning
2                   5        Chef Anton's Gumbo Mix

In [15]:
suppliers.join(products).head(3)

               CompanyName    City  ProductID    ProductName
SupplierID
1           Exotic Liquids  London          1           Chai
1           Exotic Liquids  London          2          Chang
1           Exotic Liquids  London          3  Aniseed Syrup

## Exercise 8

In [16]:
suppliers.reset_index(inplace=True)
suppliers.head(3)

   SupplierID                 CompanyName         City
0           1              Exotic Liquids       London
1           2  New Orleans Cajun Delights  New Orleans
2           3   Grandma Kelly's Homestead    Ann Arbor

In [17]:
suppliers.merge(products, left_on="SupplierID", right_index=True).head(3)

   SupplierID     CompanyName    City  ProductID    ProductName
0           1  Exotic Liquids  London          1           Chai
0           1  Exotic Liquids  London          2          Chang
0           1  Exotic Liquids  London          3  Aniseed Syrup

## Exercise 9

In [18]:
products.reset_index(inplace=True)
products.head(3)

   SupplierID  ProductID    ProductName
0           1          1           Chai
1           1          2          Chang
2           1          3  Aniseed Syrup

In [19]:
products.rename({'SupplierID':'supplier_id'}, axis=1, inplace=True)
products.head(3)

   supplier_id  ProductID    ProductName
0            1          1           Chai
1            1          2          Chang
2            1          3  Aniseed Syrup

In [20]:
suppliers.merge(products, left_on="SupplierID", right_on="supplier_id").head(3)

   SupplierID     CompanyName    City  supplier_id  ProductID    ProductName
0           1  Exotic Liquids  London            1          1           Chai
1           1  Exotic Liquids  London            1          2          Chang
2           1  Exotic Liquids  London            1          3  Aniseed Syrup